import React from 'react'
import './Terms.css'
import Logo from '../LOGO/Logo'
import Footer from '../Footer/Footer'
import NavBar from '../MainPage/NavBar/NavBar'

function Terms() {
  return (
    <>
    <Logo/>
    <NavBar/>
    <div className='aboutus_content'>
        <div className='aboutus_arab'>
            <p>
            <h1>مقدمة</h1>

  <p>مرحبًا بك في منصة المتابعة القانونية . توفر المنصة خدمة مراقبة التطورات القانونية ذات الصلة بمجال عملك . تُقدم هذه الشروط  أحكامًا تحكم استخدامك للمنصة والخدمة. يرجى قراءة هذه الشروط بعناية قبل استخدام المنصة أو الخدمة. باستخدام المنصة أو الخدمة، فإنك توافق على الالتزام بهذه الشروط.</p>

  <h2>1. الوصول إلى المنصة واستخدامها</h2>

  <p>1.1. يجب عليك إنشاء حساب على المنصة لتتمكن من استخدام الخدمة. عند إنشاء حساب، ستُطلب منك تقديم معلومات معينة عن نفسك، بما في ذلك اسمك وعنوان بريدك الإلكتروني وكلمة المرور. أنت مسؤول عن صحة ودقة واكتمال المعلومات التي تقدمها. يجب عليك الحفاظ على سرية كلمة المرور الخاصة بك وعدم مشاركتها مع أي شخص آخر.</p>

  <p>1.2. توافق على عدم استخدام المنصة أو الخدمة لأي غرض غير قانوني أو ضار أو مسيء. على وجه الخصوص، توافق على عدم:</p>

  <ul>
    <li>محاولة تعطيل أو إتلاف أو التداخل مع تشغيل المنصة أو الخدمة؛</li>
    <li>استخدام أي وسيلة آلية، بما في ذلك البرامج الآلية أو البرامج النصية أو الروبوتات، للوصول إلى المنصة أو الخدمة أو استخدامها؛</li>
    <li>جمع أو تخزين أي معلومات شخصية عن مستخدمي المنصة الآخرين دون موافقتهم</li>
    <li>إرسال بريد إلكتروني غير مرغوب فيه.</li>
  </ul>

  <p>1.3. قد تقوم المنصة بحظر حسابك أو تعليقه أو إنهائه إذا انتهكت هذه الشروط أو أي شروط أخرى تنطبق على استخدامك للمنصة أو الخدمة.</p>

  <h2>2. التغييرات على هذه الشروط</h2>

  <p>قد تقوم المنصة بتعديل هذه الشروط من وقت لآخر. ستصبح أي تغييرات سارية المفعول فور نشرها على المنصة. من خلال الاستمرار في استخدام المنصة أو الخدمة بعد نشر أي تغييرات على هذه الشروط، فإنك توافق على الالتزام بهذه الشروط المعدلة.</p>

  <h2>3. الأحكام العامة</h2>

  <p>6.1. تخضع هذه الشروط لقوانين الجزائر وتُفسر وفقًا لها.</p>

  <p>6.2. إذا تم اعتبار أي حكم من أحكام هذه الشروط غير صالح أو غير قابل للتنفيذ، فإن ذلك الحكم سيتم فصله عن هذه الشروط وستظل الأحكام المتبقية سارية المفعول.</p>

  <p>6.3. تشكل هذه الشروط الاتفاقية الكاملة بين الطرفين فيما يتعلق بموضوع هذه الشروط وتحل محل أي اتفاقيات أو تفاهمات سابقة بين الطرفين</p>


                </p>
        </div>


    </div>
    <Footer/>
    </>
  )
}

export default Terms
